## Deploy to tempdev.shared

Note import of `aws_cloudwatch_log_group.chatbot`

```
...
Creating shared.tf.json
terraform validate
Success! The configuration is valid.

python /Users/daniel/repo/azul3/scripts/rename_resources.py
2025-02-25 09:42:47,711    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-25 09:42:49,336    INFO MainThread __main__: Found 'aws_securityhub_standards_control.nist_control_macie_1', already renamed
2025-02-25 09:42:49,337    INFO MainThread __main__: Found 'aws_securityhub_standards_control.nist_control_macie_2', already renamed
python /Users/daniel/repo/azul3/scripts/import_default_vpc.py
2025-02-25 09:42:49,519    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-25 09:42:51,150    INFO MainThread __main__: The default VPC has already been imported.
2025-02-25 09:42:51,150    INFO MainThread __main__: The default VPC's default security group has already been imported.
python /Users/daniel/repo/azul3/scripts/import_cloudwatch_log_groups.py
2025-02-25 09:42:51,360    INFO MainThread botocore.credentials: Found credentials in environment variables.
2025-02-25 09:42:51,937    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-25 09:42:53,574    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.chatbot'.
2025-02-25 09:42:53,574    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.chatbot', '/aws/chatbot/azul-chatbot-tempdev']
terraform apply
data.aws_vpc.default: Reading...

...

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.chatbot will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "chatbot" {
        id                = "/aws/chatbot/azul-chatbot-tempdev"
        name              = "/aws/chatbot/azul-chatbot-tempdev"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"                = "azul-chatbot"
          + "billing"             = "anvil"
          + "component"           = "azul-chatbot"
          + "deployment"          = "tempdev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
      ~ tags_all          = {
          + "Name"                = "azul-chatbot"
          + "billing"             = "anvil"
          + "component"           = "azul-chatbot"
          + "deployment"          = "tempdev"
          + "owner"               = "hannes@ucsc.edu"
          + "service"             = "azul"
          + "terraform_component" = "shared"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_s3_bucket_lifecycle_configuration.aws_config will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "aws_config" {
      + bucket                                 = "edu-ucsc-gi-platform-temp-dev-awsconfig.us-east-1"
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = (known after apply)

      + rule {
          + id     = "expire"
          + status = "Enabled"

          + expiration {
              + days                         = 365
              + expired_object_delete_marker = (known after apply)
            }

          + filter {
            }
        }
    }

  # null_resource.image_2uFW_Y3KhG1_fxcxU05r03sqN2E must be replaced
-/+ resource "null_resource" "image_2uFW_Y3KhG1_fxcxU05r03sqN2E" {
      ~ id       = "3916589616287113937" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always" = "2025-02-25T17:03:19Z" -> (known after apply)
        }
    }

...

  # null_resource.repository_zWG8IIspasm7Xd9EUMjU6ACUZec must be replaced
-/+ resource "null_resource" "repository_zWG8IIspasm7Xd9EUMjU6ACUZec" {
      ~ id       = "2610529275472644968" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always" = "2025-02-25T17:04:15Z" -> (known after apply)
        }
    }

Plan: 24 to add, 1 to change, 23 to destroy.
...
Apply complete! Resources: 24 added, 1 changed, 23 destroyed.
```

## Redeploy to tempdev.shared

Note skipped import of `aws_cloudwatch_log_group.chatbot`
```
...
Creating shared.tf.json
terraform validate
Success! The configuration is valid.

python /Users/daniel/repo/azul2/scripts/rename_resources.py
2025-02-25 10:10:21,634    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-25 10:10:23,270    INFO MainThread __main__: Found 'aws_securityhub_standards_control.nist_control_macie_1', already renamed
2025-02-25 10:10:23,270    INFO MainThread __main__: Found 'aws_securityhub_standards_control.nist_control_macie_2', already renamed
python /Users/daniel/repo/azul2/scripts/import_default_vpc.py
2025-02-25 10:10:23,470    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-25 10:10:25,135    INFO MainThread __main__: The default VPC has already been imported.
2025-02-25 10:10:25,135    INFO MainThread __main__: The default VPC's default security group has already been imported.
python /Users/daniel/repo/azul2/scripts/import_cloudwatch_log_groups.py
2025-02-25 10:10:25,310    INFO MainThread botocore.credentials: Found credentials in environment variables.
2025-02-25 10:10:25,828    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-25 10:10:27,446    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.chatbot'.
terraform apply
data.aws_region.current: Reading...
...
```

## Deploy to tempdev

Note rename and import of aws_cloudwatch_log_groups. Also note that the import was skipped for log groups that do not exist (yet) on tempdev.

```
...
Creating step_function.tf.json
terraform validate
Success! The configuration is valid.

python /Users/daniel/repo/azul3/scripts/rename_resources.py
2025-02-25 09:47:40,535    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-25 09:47:42,401    INFO MainThread __main__: Found 'aws_cloudwatch_log_group.indexer', renaming it to 'aws_cloudwatch_log_group.indexer_api_gateway'
2025-02-25 09:47:42,401    INFO MainThread azul.terraform: Running ['terraform', 'state', 'mv', 'aws_cloudwatch_log_group.indexer', 'aws_cloudwatch_log_group.indexer_api_gateway']
2025-02-25 09:47:55,372    INFO MainThread __main__: Found 'aws_cloudwatch_log_group.service', renaming it to 'aws_cloudwatch_log_group.service_api_gateway'
2025-02-25 09:47:55,372    INFO MainThread azul.terraform: Running ['terraform', 'state', 'mv', 'aws_cloudwatch_log_group.service', 'aws_cloudwatch_log_group.service_api_gateway']
python /Users/daniel/repo/azul3/scripts/import_cloudwatch_log_groups.py
2025-02-25 09:48:02,452    INFO MainThread botocore.credentials: Found credentials in environment variables.
2025-02-25 09:48:03,769    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-25 09:48:05,478    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.indexer_indexercachehealth_lambda'.
2025-02-25 09:48:05,479    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.indexer_indexercachehealth_lambda', '/aws/lambda/azul-indexer-tempdev-indexercachehealth']
2025-02-25 09:48:19,414    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_contribute_lambda', log group does not exist.
2025-02-25 09:48:19,414    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_aggregate_lambda', log group does not exist.
2025-02-25 09:48:19,414    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_aggregate_retry_lambda', log group does not exist.
2025-02-25 09:48:19,414    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_contribute_retry_lambda', log group does not exist.
2025-02-25 09:48:19,414    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.indexer_forward_alb_logs_lambda'.
2025-02-25 09:48:19,414    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.indexer_forward_alb_logs_lambda', '/aws/lambda/azul-indexer-tempdev-forward_alb_logs']
2025-02-25 09:48:26,746    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.indexer_forward_s3_logs_lambda'.
2025-02-25 09:48:26,747    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.indexer_forward_s3_logs_lambda', '/aws/lambda/azul-indexer-tempdev-forward_s3_logs']
2025-02-25 09:48:33,782    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.indexer_lambda'.
2025-02-25 09:48:33,782    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.indexer_lambda', '/aws/lambda/azul-indexer-tempdev']
2025-02-25 09:48:41,847    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.service_manifest_lambda', log group does not exist.
2025-02-25 09:48:41,847    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.service_servicecachehealth_lambda'.
2025-02-25 09:48:41,847    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.service_servicecachehealth_lambda', '/aws/lambda/azul-service-tempdev-servicecachehealth']
2025-02-25 09:48:51,835    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.service_lambda'.
2025-02-25 09:48:51,836    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.service_lambda', '/aws/lambda/azul-service-tempdev']
2025-02-25 09:48:59,490    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.indexer_api_execution'.
2025-02-25 09:48:59,490    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.indexer_api_execution', 'API-Gateway-Execution-Logs_d9xt10gjh8/tempdev']
2025-02-25 09:49:07,149    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.service_api_execution'.
2025-02-25 09:49:07,149    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.service_api_execution', 'API-Gateway-Execution-Logs_en4r0jtgri/tempdev']
terraform apply
null_resource.hmac_secret: Refreshing state... [id=5577006791947779410]

...

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.indexer_aggregate_lambda will be created
  + resource "aws_cloudwatch_log_group" "indexer_aggregate_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/azul-indexer-tempdev-aggregate"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "Name"       = "azul-indexer_aggregate_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_aggregate_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all          = {
          + "Name"       = "azul-indexer_aggregate_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_aggregate_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
    }

  # aws_cloudwatch_log_group.indexer_aggregate_retry_lambda will be created
  + resource "aws_cloudwatch_log_group" "indexer_aggregate_retry_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/azul-indexer-tempdev-aggregate_retry"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "Name"       = "azul-indexer_aggregate_retry_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_aggregate_retry_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all          = {
          + "Name"       = "azul-indexer_aggregate_retry_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_aggregate_retry_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
    }

  # aws_cloudwatch_log_group.indexer_api_execution will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_api_execution" {
        id                = "API-Gateway-Execution-Logs_d9xt10gjh8/tempdev"
        name              = "API-Gateway-Execution-Logs_d9xt10gjh8/tempdev"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-indexer_api_execution-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_api_execution"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-indexer_api_execution-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_api_execution"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.indexer_api_gateway will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_api_gateway" {
        id                = "/aws/apigateway/azul-indexer-tempdev"
        name              = "/aws/apigateway/azul-indexer-tempdev"
      ~ tags              = {
          ~ "Name"       = "azul-indexer-tempdev" -> "azul-indexer_api_gateway-tempdev"
            "billing"    = "anvil"
          ~ "component"  = "azul-indexer" -> "azul-indexer_api_gateway"
            "deployment" = "tempdev"
            "owner"      = "hannes@ucsc.edu"
            "service"    = "azul"
        }
      ~ tags_all          = {
          ~ "Name"       = "azul-indexer-tempdev" -> "azul-indexer_api_gateway-tempdev"
          ~ "component"  = "azul-indexer" -> "azul-indexer_api_gateway"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.indexer_contribute_lambda will be created
  + resource "aws_cloudwatch_log_group" "indexer_contribute_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/azul-indexer-tempdev-contribute"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "Name"       = "azul-indexer_contribute_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_contribute_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all          = {
          + "Name"       = "azul-indexer_contribute_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_contribute_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
    }

  # aws_cloudwatch_log_group.indexer_contribute_retry_lambda will be created
  + resource "aws_cloudwatch_log_group" "indexer_contribute_retry_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/azul-indexer-tempdev-contribute_retry"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "Name"       = "azul-indexer_contribute_retry_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_contribute_retry_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all          = {
          + "Name"       = "azul-indexer_contribute_retry_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_contribute_retry_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
    }

  # aws_cloudwatch_log_group.indexer_forward_alb_logs_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_forward_alb_logs_lambda" {
        id                = "/aws/lambda/azul-indexer-tempdev-forward_alb_logs"
        name              = "/aws/lambda/azul-indexer-tempdev-forward_alb_logs"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-indexer_forward_alb_logs_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_forward_alb_logs_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-indexer_forward_alb_logs_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_forward_alb_logs_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.indexer_forward_s3_logs_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_forward_s3_logs_lambda" {
        id                = "/aws/lambda/azul-indexer-tempdev-forward_s3_logs"
        name              = "/aws/lambda/azul-indexer-tempdev-forward_s3_logs"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-indexer_forward_s3_logs_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_forward_s3_logs_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-indexer_forward_s3_logs_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_forward_s3_logs_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.indexer_indexercachehealth_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_indexercachehealth_lambda" {
        id                = "/aws/lambda/azul-indexer-tempdev-indexercachehealth"
        name              = "/aws/lambda/azul-indexer-tempdev-indexercachehealth"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-indexer_indexercachehealth_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_indexercachehealth_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-indexer_indexercachehealth_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_indexercachehealth_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.indexer_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_lambda" {
        id                = "/aws/lambda/azul-indexer-tempdev"
        name              = "/aws/lambda/azul-indexer-tempdev"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-indexer_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-indexer_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-indexer_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.service_api_execution will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "service_api_execution" {
        id                = "API-Gateway-Execution-Logs_en4r0jtgri/tempdev"
        name              = "API-Gateway-Execution-Logs_en4r0jtgri/tempdev"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-service_api_execution-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-service_api_execution"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-service_api_execution-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-service_api_execution"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.service_api_gateway will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "service_api_gateway" {
        id                = "/aws/apigateway/azul-service-tempdev"
        name              = "/aws/apigateway/azul-service-tempdev"
      ~ tags              = {
          ~ "Name"       = "azul-service-tempdev" -> "azul-service_api_gateway-tempdev"
            "billing"    = "anvil"
          ~ "component"  = "azul-service" -> "azul-service_api_gateway"
            "deployment" = "tempdev"
            "owner"      = "hannes@ucsc.edu"
            "service"    = "azul"
        }
      ~ tags_all          = {
          ~ "Name"       = "azul-service-tempdev" -> "azul-service_api_gateway-tempdev"
          ~ "component"  = "azul-service" -> "azul-service_api_gateway"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.service_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "service_lambda" {
        id                = "/aws/lambda/azul-service-tempdev"
        name              = "/aws/lambda/azul-service-tempdev"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-service_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-service_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-service_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-service_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.service_manifest_lambda will be created
  + resource "aws_cloudwatch_log_group" "service_manifest_lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/azul-service-tempdev-manifest"
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = {
          + "Name"       = "azul-service_manifest_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-service_manifest_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all          = {
          + "Name"       = "azul-service_manifest_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-service_manifest_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
    }

  # aws_cloudwatch_log_group.service_servicecachehealth_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "service_servicecachehealth_lambda" {
        id                = "/aws/lambda/azul-service-tempdev-servicecachehealth"
        name              = "/aws/lambda/azul-service-tempdev-servicecachehealth"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-service_servicecachehealth_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-service_servicecachehealth_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-service_servicecachehealth_lambda-tempdev"
          + "billing"    = "anvil"
          + "component"  = "azul-service_servicecachehealth_lambda"
          + "deployment" = "tempdev"
          + "owner"      = "hannes@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_function.indexer will be updated in-place
  ~ resource "aws_lambda_function" "indexer" {
        id                             = "azul-indexer-tempdev"
        tags                           = {
            "Name"        = "azul-indexer-tempdev"
            "aws-chalice" = "version=1.31.3:stage=tempdev:app=azul-indexer"
            "billing"     = "anvil"
            "component"   = "azul-indexer"
            "deployment"  = "tempdev"
            "owner"       = "hannes@ucsc.edu"
            "service"     = "azul"
        }
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "azul_git_commit"                          = "3f8d8d9fb3441bbbfb05fa766ec8d97e82b8b59c" -> "2fa8f707f9b593b00634339fa77e3a05eed3e0cf"
                # (43 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

...

  # aws_lambda_function.service_servicecachehealth will be updated in-place
  ~ resource "aws_lambda_function" "service_servicecachehealth" {
        id                             = "azul-service-tempdev-servicecachehealth"
        tags                           = {
            "Name"        = "azul-service_servicecachehealth-tempdev"
            "aws-chalice" = "version=1.31.3:stage=tempdev:app=azul-service"
            "billing"     = "anvil"
            "component"   = "azul-service_servicecachehealth"
            "deployment"  = "tempdev"
            "owner"       = "hannes@ucsc.edu"
            "service"     = "azul"
        }
        # (29 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "azul_git_commit"                          = "3f8d8d9fb3441bbbfb05fa766ec8d97e82b8b59c" -> "2fa8f707f9b593b00634339fa77e3a05eed3e0cf"
                # (43 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 5 to add, 21 to change, 0 to destroy.
...
Apply complete! Resources: 5 added, 21 changed, 0 destroyed.
```

## Redeploy to tempdev

Note skipped import of aws_cloudwatch_log_group resources

```
...
Creating step_function.tf.json
terraform validate
Success! The configuration is valid.

python /Users/daniel/repo/azul2/scripts/rename_resources.py
2025-02-25 10:18:32,051    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-25 10:18:33,847    INFO MainThread __main__: Found 'aws_cloudwatch_log_group.indexer_api_gateway', already renamed
2025-02-25 10:18:33,847    INFO MainThread __main__: Found 'aws_cloudwatch_log_group.service_api_gateway', already renamed
python /Users/daniel/repo/azul2/scripts/import_cloudwatch_log_groups.py
2025-02-25 10:18:34,014    INFO MainThread botocore.credentials: Found credentials in environment variables.
2025-02-25 10:18:35,057    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-25 10:18:37,054    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_lambda'.
2025-02-25 10:18:37,054    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_aggregate_lambda'.
2025-02-25 10:18:37,054    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_aggregate_retry_lambda'.
2025-02-25 10:18:37,054    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_contribute_lambda'.
2025-02-25 10:18:37,054    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_contribute_retry_lambda'.
2025-02-25 10:18:37,054    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_forward_alb_logs_lambda'.
2025-02-25 10:18:37,054    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_forward_s3_logs_lambda'.
2025-02-25 10:18:37,054    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_indexercachehealth_lambda'.
2025-02-25 10:18:37,054    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.service_lambda'.
2025-02-25 10:18:37,054    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.service_manifest_lambda'.
2025-02-25 10:18:37,054    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.service_servicecachehealth_lambda'.
2025-02-25 10:18:37,054    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_api_execution'.
2025-02-25 10:18:37,054    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.service_api_execution'.
terraform apply
null_resource.hmac_secret: Refreshing state... [id=5577006791947779410]
...
```

## Deploy to daniel.local

```
...
Creating step_function.tf.json
terraform validate
Success! The configuration is valid.

python /Users/daniel/repo/azul3/scripts/rename_resources.py
2025-02-25 09:53:49,411    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-25 09:53:51,828    INFO MainThread __main__: Found 'aws_cloudwatch_log_group.indexer', renaming it to 'aws_cloudwatch_log_group.indexer_api_gateway'
2025-02-25 09:53:51,828    INFO MainThread azul.terraform: Running ['terraform', 'state', 'mv', 'aws_cloudwatch_log_group.indexer', 'aws_cloudwatch_log_group.indexer_api_gateway']
2025-02-25 09:54:07,478    INFO MainThread __main__: Found 'aws_cloudwatch_log_group.service', renaming it to 'aws_cloudwatch_log_group.service_api_gateway'
2025-02-25 09:54:07,478    INFO MainThread azul.terraform: Running ['terraform', 'state', 'mv', 'aws_cloudwatch_log_group.service', 'aws_cloudwatch_log_group.service_api_gateway']
python /Users/daniel/repo/azul3/scripts/import_cloudwatch_log_groups.py
2025-02-25 09:54:14,679    INFO MainThread botocore.credentials: Found credentials in environment variables.
2025-02-25 09:54:17,678    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-25 09:54:19,394    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.indexer_indexercachehealth_lambda'.
2025-02-25 09:54:19,395    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.indexer_indexercachehealth_lambda', '/aws/lambda/azul-indexer-daniel-indexercachehealth']
2025-02-25 09:54:25,263    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.indexer_contribute_lambda'.
2025-02-25 09:54:25,263    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.indexer_contribute_lambda', '/aws/lambda/azul-indexer-daniel-contribute']
2025-02-25 09:54:31,467    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.indexer_aggregate_lambda'.
2025-02-25 09:54:31,468    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.indexer_aggregate_lambda', '/aws/lambda/azul-indexer-daniel-aggregate']
2025-02-25 09:54:37,382    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.indexer_aggregate_retry_lambda'.
2025-02-25 09:54:37,382    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.indexer_aggregate_retry_lambda', '/aws/lambda/azul-indexer-daniel-aggregate_retry']
2025-02-25 09:54:43,411    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.indexer_contribute_retry_lambda'.
2025-02-25 09:54:43,411    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.indexer_contribute_retry_lambda', '/aws/lambda/azul-indexer-daniel-contribute_retry']
2025-02-25 09:54:49,510    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.indexer_lambda'.
2025-02-25 09:54:49,510    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.indexer_lambda', '/aws/lambda/azul-indexer-daniel']
2025-02-25 09:54:54,712    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.service_manifest_lambda'.
2025-02-25 09:54:54,713    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.service_manifest_lambda', '/aws/lambda/azul-service-daniel-manifest']
2025-02-25 09:55:00,288    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.service_servicecachehealth_lambda'.
2025-02-25 09:55:00,289    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.service_servicecachehealth_lambda', '/aws/lambda/azul-service-daniel-servicecachehealth']
2025-02-25 09:55:05,485    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.service_lambda'.
2025-02-25 09:55:05,486    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.service_lambda', '/aws/lambda/azul-service-daniel']
2025-02-25 09:55:10,609    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.indexer_api_execution'.
2025-02-25 09:55:10,609    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.indexer_api_execution', 'API-Gateway-Execution-Logs_9p8vpm3fhc/daniel']
2025-02-25 09:55:15,778    INFO MainThread __main__: Importing resource 'aws_cloudwatch_log_group.service_api_execution'.
2025-02-25 09:55:15,778    INFO MainThread azul.terraform: Running ['terraform', 'import', 'aws_cloudwatch_log_group.service_api_execution', 'API-Gateway-Execution-Logs_p19igkx6t7/daniel']
terraform apply
null_resource.hmac_secret: Refreshing state... [id=5577006791947779410]

...

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.indexer_aggregate_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_aggregate_lambda" {
        id                = "/aws/lambda/azul-indexer-daniel-aggregate"
        name              = "/aws/lambda/azul-indexer-daniel-aggregate"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-indexer_aggregate_lambda-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_aggregate_lambda"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-indexer_aggregate_lambda-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_aggregate_lambda"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.indexer_aggregate_retry_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_aggregate_retry_lambda" {
        id                = "/aws/lambda/azul-indexer-daniel-aggregate_retry"
        name              = "/aws/lambda/azul-indexer-daniel-aggregate_retry"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-indexer_aggregate_retry_lambda-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_aggregate_retry_lambda"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-indexer_aggregate_retry_lambda-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_aggregate_retry_lambda"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.indexer_api_execution must be replaced
-/+ resource "aws_cloudwatch_log_group" "indexer_api_execution" {
      ~ arn               = "arn:aws:logs:us-east-1:122796619775:log-group:API-Gateway-Execution-Logs_9p8vpm3fhc/daniel" -> (known after apply)
      ~ id                = "API-Gateway-Execution-Logs_9p8vpm3fhc/daniel" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "API-Gateway-Execution-Logs_9p8vpm3fhc/daniel" -> "API-Gateway-Execution-Logs_9p8vpm3fhc/dev" # forces replacement
      + name_prefix       = (known after apply)
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-indexer_api_execution-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_api_execution"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-indexer_api_execution-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_api_execution"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.indexer_api_gateway will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_api_gateway" {
        id                = "/aws/apigateway/azul-indexer-daniel"
        name              = "/aws/apigateway/azul-indexer-daniel"
      ~ tags              = {
          ~ "Name"       = "azul-indexer-daniel" -> "azul-indexer_api_gateway-daniel"
            "billing"    = "hca"
          ~ "component"  = "azul-indexer" -> "azul-indexer_api_gateway"
            "deployment" = "daniel"
            "owner"      = "dsotirho@ucsc.edu"
            "service"    = "azul"
        }
      ~ tags_all          = {
          ~ "Name"       = "azul-indexer-daniel" -> "azul-indexer_api_gateway-daniel"
          ~ "component"  = "azul-indexer" -> "azul-indexer_api_gateway"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.indexer_contribute_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_contribute_lambda" {
        id                = "/aws/lambda/azul-indexer-daniel-contribute"
        name              = "/aws/lambda/azul-indexer-daniel-contribute"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-indexer_contribute_lambda-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_contribute_lambda"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-indexer_contribute_lambda-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_contribute_lambda"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.indexer_contribute_retry_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_contribute_retry_lambda" {
        id                = "/aws/lambda/azul-indexer-daniel-contribute_retry"
        name              = "/aws/lambda/azul-indexer-daniel-contribute_retry"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-indexer_contribute_retry_lambda-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_contribute_retry_lambda"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-indexer_contribute_retry_lambda-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_contribute_retry_lambda"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.indexer_indexercachehealth_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_indexercachehealth_lambda" {
        id                = "/aws/lambda/azul-indexer-daniel-indexercachehealth"
        name              = "/aws/lambda/azul-indexer-daniel-indexercachehealth"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-indexer_indexercachehealth_lambda-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_indexercachehealth_lambda"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-indexer_indexercachehealth_lambda-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_indexercachehealth_lambda"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.indexer_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "indexer_lambda" {
        id                = "/aws/lambda/azul-indexer-daniel"
        name              = "/aws/lambda/azul-indexer-daniel"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-indexer_lambda-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_lambda"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-indexer_lambda-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-indexer_lambda"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.service_api_execution must be replaced
-/+ resource "aws_cloudwatch_log_group" "service_api_execution" {
      ~ arn               = "arn:aws:logs:us-east-1:122796619775:log-group:API-Gateway-Execution-Logs_p19igkx6t7/daniel" -> (known after apply)
      ~ id                = "API-Gateway-Execution-Logs_p19igkx6t7/daniel" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "API-Gateway-Execution-Logs_p19igkx6t7/daniel" -> "API-Gateway-Execution-Logs_p19igkx6t7/dev" # forces replacement
      + name_prefix       = (known after apply)
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-service_api_execution-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-service_api_execution"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-service_api_execution-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-service_api_execution"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.service_api_gateway will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "service_api_gateway" {
        id                = "/aws/apigateway/azul-service-daniel"
        name              = "/aws/apigateway/azul-service-daniel"
      ~ tags              = {
          ~ "Name"       = "azul-service-daniel" -> "azul-service_api_gateway-daniel"
            "billing"    = "hca"
          ~ "component"  = "azul-service" -> "azul-service_api_gateway"
            "deployment" = "daniel"
            "owner"      = "dsotirho@ucsc.edu"
            "service"    = "azul"
        }
      ~ tags_all          = {
          ~ "Name"       = "azul-service-daniel" -> "azul-service_api_gateway-daniel"
          ~ "component"  = "azul-service" -> "azul-service_api_gateway"
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.service_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "service_lambda" {
        id                = "/aws/lambda/azul-service-daniel"
        name              = "/aws/lambda/azul-service-daniel"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-service_lambda-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-service_lambda"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-service_lambda-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-service_lambda"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.service_manifest_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "service_manifest_lambda" {
        id                = "/aws/lambda/azul-service-daniel-manifest"
        name              = "/aws/lambda/azul-service-daniel-manifest"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-service_manifest_lambda-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-service_manifest_lambda"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-service_manifest_lambda-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-service_manifest_lambda"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.service_servicecachehealth_lambda will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "service_servicecachehealth_lambda" {
        id                = "/aws/lambda/azul-service-daniel-servicecachehealth"
        name              = "/aws/lambda/azul-service-daniel-servicecachehealth"
      ~ retention_in_days = 0 -> 365
      ~ tags              = {
          + "Name"       = "azul-service_servicecachehealth_lambda-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-service_servicecachehealth_lambda"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      ~ tags_all          = {
          + "Name"       = "azul-service_servicecachehealth_lambda-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-service_servicecachehealth_lambda"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_function.indexer will be updated in-place
  ~ resource "aws_lambda_function" "indexer" {
      ~ filename                       = "/Users/daniel/repo/azul1/lambdas/indexer/.chalice/terraform/deployment.zip" -> "/Users/daniel/repo/azul3/lambdas/indexer/.chalice/terraform/deployment.zip"
        id                             = "azul-indexer-daniel"
      ~ last_modified                  = "2025-02-25T17:42:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "vv7lId7/FVw1tV/STn3hb+Co75hgkdd0efM+nRv5LGk=" -> "0sVXKgGKU/eMeWNraECdJQxQnP2GkkjUM4ygFEwOHVM="
        tags                           = {
            "Name"        = "azul-indexer-daniel"
            "aws-chalice" = "version=1.31.3:stage=daniel:app=azul-indexer"
            "billing"     = "hca"
            "component"   = "azul-indexer"
            "deployment"  = "daniel"
            "owner"       = "dsotirho@ucsc.edu"
            "service"     = "azul"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "azul_git_commit"                          = "3f8d8d9fb3441bbbfb05fa766ec8d97e82b8b59c" -> "2fa8f707f9b593b00634339fa77e3a05eed3e0cf"
              ~ "azul_git_dirty"                           = "False" -> "True"
                # (39 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

...

  # aws_lambda_function.service_servicecachehealth will be updated in-place
  ~ resource "aws_lambda_function" "service_servicecachehealth" {
      ~ filename                       = "/Users/daniel/repo/azul1/lambdas/service/.chalice/terraform/deployment.zip" -> "/Users/daniel/repo/azul3/lambdas/service/.chalice/terraform/deployment.zip"
        id                             = "azul-service-daniel-servicecachehealth"
      ~ last_modified                  = "2025-02-25T17:43:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "i1T6Fe6htU27wC5f8zWw+yoAgrZg7rukY5bSkMY3UFg=" -> "+G5cKJRyVWScpHiwnSgsS7aRFpuu4aIEbNqn08+7gF4="
        tags                           = {
            "Name"        = "azul-service_servicecachehealth-daniel"
            "aws-chalice" = "version=1.31.3:stage=daniel:app=azul-service"
            "billing"     = "hca"
            "component"   = "azul-service_servicecachehealth"
            "deployment"  = "daniel"
            "owner"       = "dsotirho@ucsc.edu"
            "service"     = "azul"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "azul_git_commit"                          = "3f8d8d9fb3441bbbfb05fa766ec8d97e82b8b59c" -> "2fa8f707f9b593b00634339fa77e3a05eed3e0cf"
              ~ "azul_git_dirty"                           = "False" -> "True"
                # (39 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 2 to add, 20 to change, 2 to destroy.
...
Apply complete! Resources: 2 added, 20 changed, 2 destroyed.
```

## Redeploy to daniel.local

```
...
Creating step_function.tf.json
terraform validate
Success! The configuration is valid.

python /Users/daniel/repo/azul3/scripts/rename_resources.py
2025-02-25 10:00:07,617    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-25 10:00:09,322    INFO MainThread __main__: Found 'aws_cloudwatch_log_group.indexer_api_gateway', already renamed
2025-02-25 10:00:09,322    INFO MainThread __main__: Found 'aws_cloudwatch_log_group.service_api_gateway', already renamed
python /Users/daniel/repo/azul3/scripts/import_cloudwatch_log_groups.py
2025-02-25 10:00:09,486    INFO MainThread botocore.credentials: Found credentials in environment variables.
2025-02-25 10:00:12,240    INFO MainThread azul.terraform: Running ['terraform', 'state', 'list']
2025-02-25 10:00:13,925    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_indexercachehealth_lambda', resource already exists.
2025-02-25 10:00:13,925    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_contribute_lambda', resource already exists.
2025-02-25 10:00:13,925    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_aggregate_lambda', resource already exists.
2025-02-25 10:00:13,925    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_aggregate_retry_lambda', resource already exists.
2025-02-25 10:00:13,925    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_contribute_retry_lambda', resource already exists.
2025-02-25 10:00:13,925    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_lambda', resource already exists.
2025-02-25 10:00:13,925    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.service_manifest_lambda', resource already exists.
2025-02-25 10:00:13,925    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.service_servicecachehealth_lambda', resource already exists.
2025-02-25 10:00:13,925    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.service_lambda', resource already exists.
2025-02-25 10:00:13,925    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.indexer_api_execution', resource already exists.
2025-02-25 10:00:13,926    INFO MainThread __main__: Skipping import of 'aws_cloudwatch_log_group.service_api_execution', resource already exists.
terraform plan -no-color -out=plan.bin
data.external.elasticsearch_nodes: Reading...
...
```